{
  "cognitive_os": {
    "input_processing": "High-Velocity Dump & Sort. You perceive the world through a firehose of disparate inputs (technical errors, emotional insights, parenting chaos, creative sparks). You do not pre-filter; you ingest everything and rely on external systems (or the AI) to perform the triage and categorization that your internal working memory struggles to maintain.",
    "problem_solving_style": "Recursive Systems Engineering. You rarely solve a problem in isolation. If you encounter a specific issue (e.g., 'kids won't clean up'), you do not just ask for a tip; you attempt to engineer a permanent, automated system (e.g., 'gamified NFC chore tracker with e-ink display'). You reframe human/behavioral problems as engineering/software challenges.",
    "learning_patterns": "Just-In-Time Architecture. You do not learn linearly (A->B->C). You learn radially from a project center. You pick a target (e.g., 'Build a Home Lab') and violently expand your knowledge graph in whatever direction the immediate blockers require (Docker -> Linux Permissions -> Networking -> Hardware). You learn by *building broken things and fixing them*.",
    "motivation_drivers": "1. Friction Elimination (intolerance for repetitive manual tasks). 2. Novelty/Complexity (getting dopamine from designing the 'perfect' system). 3. Autonomy (owning your data, your servers, your tools). 4. 'The Grand Unified Theory' (finding the deep link between unrelated domains, e.g., parenting and software architecture).",
    "adhd_signatures": {
      "time_blindness": "Deep struggle with temporal continuity. You embrace 'Flow Mode' but fear 'drift'. You try to engineer clocks/reminders into the environment (NFC tags, automated briefings).",
      "executive_offloading": "You explicitly hire the AI to be your 'Prefrontal Cortex', asking it to 'break this down', 'make a plan', or 'act as a project manager'.",
      "object_impermanence": "If a project or idea is not visible/active, it effectively ceases to exist. This drives your need for 'resurfacing' tools and 'dashboards'.",
      "hyperfocus_rabbit_holes": "Tendency to spend disproportionate energy on 'meta-work' (configuring the tool to do the work) rather than the work itself."
    },
    "characteristic_failure_modes": "The 'Mega-Project' Trap. You often expand the scope of a solution until it becomes too complex to maintain, leading to abandonment. You have a graveyard of 'half-finished shortcuts' and 'unmaintained servers' because the maintenance cost exceeded the dopamine hit of creation.",
    "unblocking_strategies": "1. 'Gamification' (turning chores into quests). 2. 'Conversational Mirroring' (talking to the AI to hear your own thoughts reflected back with structure). 3. 'Scaffolding' (asking for a template/boilerplate to bypass the 'blank page' paralysis).",
    "internal_physics": "Technological Solutionism. You believe that *entropy* (chaos/mess/forgetting) is a bug that can be patched with sufficient code, automation, and system architecture. You view your own mind as a piece of software that can be refactored."
  },
  "ies_implications": "Your Idea Extraction System (IES) must not be a passive archive. It must be an **Active Prosthetic**. \n1. **Capture must be zero-friction** (voice, auto-forwarding, API hooks) because if it takes effort, you won't do it.\n2. **The system must 'poke' you.** It needs to proactively resurface old nodes ('You were thinking about X last month, does this new Y relate?').\n3. **Structure must be emergent.** Do not force yourself to tag everything perfectly upfront. Let the AI generate the ontology/graph in the background.\n4. **Focus on 'State Preservation'.** The system needs to save the *context* of a project so you can pick it up 3 months later without having to relearn everything."
}