{
  "cognitive_os": {
    "input_processing": "High-Bandwidth Ingestion. You consume information not as isolated facts but as raw material for potential systems. You toggle rapidly between highly technical minutiae (server logs, CSS, API schemas) and high-level philosophical or psychological concepts (parenting frameworks, self-trust theory). You do not filter inputs for 'relevance' immediately; you ingest widely and rely on external tools to create structure later.",
    "problem_solving_style": "Recursive Systems Engineering. You rarely solve a problem by just 'doing the task.' Instead, you build a system to do the task for you. If you need to track chores, you build an e-ink dashboard with NFC integration. If you need to plan a vacation, you try to architect a multi-agent AI crew. You fundamentally reframe behavioral or life problems into engineering challenges that can be solved with code, hardware, or automation.",
    "learning_patterns": "Radial, Just-In-Time Expansion. You do not follow linear curriculums. You select a 'Project Node' (e.g., 'Local AI Server') and aggressively expand outward into necessary sub-domains (Linux permissions, Docker networking, GPU drivers, Python environments) only as they become blockers. You learn by breaking things in production and fixing them, valuing practical application over theoretical mastery.",
    "motivation_drivers": "1. Autonomy & Sovereignty: A strong drive to own your infrastructure (Unraid, local LLMs, Obsidian) and avoid dependency on cloud ecosystems. 2. Friction Eradication: You are highly sensitive to procedural friction and will spend hours automating a 5-minute task to avoid the mental load of doing it manually. 3. Novelty & Complexity: You derive dopamine from the *design* of a complex system, often more than its operation.",
    "adhd_signatures": {
      "time_blindness_countermeasures": "You actively fight time blindness by externalizing time into the physical environment (visual timers, e-ink displays, automated briefings).",
      "executive_offloading": "You treat AI not just as a search engine but as a prosthetic prefrontal cortex, explicitly asking it to 'break this down,' 'make a plan,' or 'act as a project manager' to bridge the gap between intent and action.",
      "object_impermanence": "If a project isn't 'on screen' or buzzing, it disappears. This drives your need for 'dashboards,' 'daily briefings,' and 'review' workflows to keep active loops visible.",
      "hyperfocus_vs_maintenance": "You exhibit intense bursts of creative energy (starting complex projects) followed by struggles with long-term maintenance, leading to a graveyard of 'half-finished' implementations."
    },
    "characteristic_failure_modes": "The 'Meta-Work' Trap. You are prone to spending more energy building the tool to do the work than doing the work itself (e.g., designing the perfect note-taking system vs. taking notes). You risk over-engineering solutions (e.g., complex multi-agent crews for simple tasks) where the complexity of the solution exceeds the complexity of the original problem.",
    "unblocking_strategies": "1. Conversational Reflection: You use the chat context as a mirror to organize your own thoughts. 2. Template Scaffolding: You ask for 'step-by-step guides' or 'file structures' to overcome the paralysis of the blank page. 3. Gamification: You try to inject novelty into mundane tasks (parenting games, chore tracking) to manufacture motivation.",
    "internal_physics": "Constructivist Materialism. You implicitly believe that 'mind' and 'behavior' are manipulable variables within a system. You view your own psychology, your children's development, and your server architecture as governed by similar rules: inputs, outputs, feedback loops, and constraints. You believe entropy is the enemy and structure (schemas, code, systems) is the cure."
  },
  "ies_implications": "The Idea Extraction System (IES) must be designed as an 'Active Exocortex,' not a passive library. 
1. **Low-Friction Capture**: Entry points must be instant (voice, API hooks) to bypass executive dysfunction. 
2. **Proactive Resurfacing**: The system must actively push relevant 'forgotten' nodes back to you, countering object impermanence. 
3. **Context Preservation**: It must save the 'mental state' of a project (where you left off, next steps) to allow for seamless context switching, which is crucial for your non-linear workflow. 
4. **Structure-on-Demand**: Allow for chaotic input, with the system responsible for retroactive structuring and tagging."
}
