{
  "internal_physics": {
    "behavior": "Behavior is deterministic output based on Environment + Friction. If the environment is confusing or friction is high, 'bad' behavior occurs (entropy). If the environment is architected (gamified, clear, automated), 'good' behavior flows naturally. Willpower is a limited and unreliable battery; System Design is the only reliable power source.",
    "motivation": "Motivation is not a moral virtue but a chemical reaction to 'Clarity' + 'Novelty.' You believe the mind (especially the ADHD mind) refuses to run on 'Shoulds' and only runs on 'Interests.' To generate motivation, you must artificially inject novelty (gamification) or clarity (breaking a vague task into tiny, solvable atoms).",
    "emotion": "Emotion is a signal, like a dashboard light. 'Anxiety' is a signal of 'Uncaptured Open Loops.' 'Frustration' is a signal of 'Bad UX/Process.' You do not treat emotions as weather to be endured but as diagnostics to be debugged. You believe that 'Self-Trust' is the master metric that regulates emotional stability.",
    "relationships": "Relationships are systems of 'Shared Reality.' Connection degrades naturally over time (entropy) unless explicit 'Maintenance Rituals' (scheduled talks, shared games, scavenger hunts) are installed to reinforce the bond. You believe love is demonstrated through the *design of experiences* and the *removal of friction* for the other person.",
    "attention": "Attention is a volatile currency that cannot be 'held' but can be 'captured.' You believe your attention naturally follows the path of 'Highest Signal/Novelty.' To focus, you must construct an environment where the 'Right Thing' is also the 'Most Interesting/Urgent Thing' (e.g., using visual timers or alarms).",
    "learning": "Learning is 'Model Construction.' You do not believe you have learned something until you have built a working model of it (a server, a script, a diagram). Passive consumption is not learning; it is just 'buffering.' True learning requires the collision of the internal model with external reality (debugging).",
    "change": "Change is a 'Phase Transition' triggered by critical mass. You do not believe in gradual, linear improvement. You believe in 'tipping points'—you struggle and thrash (accumulation of potential energy) until you find the right 'System/Tool,' at which point you undergo a rapid, non-linear transformation (phase shift)."
  },
  "ies_implications": "The IES must treat human entities not as static biographies but as 'Dynamic Systems.' \n1. **Behavioral Logging:** When logging observations about people (e.g., your kids), the system should prompt for the *context/environment* ('What was the setup?'), not just the behavior, reflecting your belief in environmental determinism. \n2. **Self-Trust Metric:** The system should explicitly track 'Wins' and 'Completions' to feed the 'Self-Trust' engine. \n3. **Relationship Maintenance:** It should treat relationships as 'Projects' with recurring tasks, preventing relational entropy."
}