{
  "worldview_schema": {
    "human_behavior": "Systemic and deterministic, yet malleable. You view behavior as an output generated by the interaction between internal neurology (e.g., ADHD wiring) and external environments. You believe that 'bad' behavior (in yourself or children) is often a design failure of the environment or a lack of scaffolding, rather than a moral failing. You see humans as 'programmable' through the right incentives, structures, and gamification.",
    "emotion_and_motivation": "Foundationalist. You believe that 'Self-Trust' and 'Confidence' are the root variables of psychological health. Motivation is not a constant fuel but a byproduct of friction-reduction and clear, novel goals (dopamine availability). You view emotional dysregulation as a 'system error' that requires debugging (identifying the trigger, adjusting the schema) rather than just 'feeling through it.'",
    "relationship_dynamics": "Intentional and Architected. You reject the idea that relationships just 'happen.' You believe they require explicit 'maintenance schedules' (e.g., 'Plan, Discuss, Connect, Thrive' frameworks) and structured communication channels to survive the entropy of daily life. You view gamification as a valid and loving way to reduce friction and increase connection in family dynamics.",
    "self_model": "The 'Buggy OS' Model. You view yourself not as a fixed entity but as a high-potential system with specific, known vulnerabilities (executive dysfunction, time blindness). You do not identify *with* these flaws; you identify as the *administrator* trying to patch them. You see your mind as an 'Idea Engine' that produces valuable output but lacks an internal storage drive, necessitating an external 'Exocortex.'",
    "growth_and_learning": "Constructivist and Radial. You believe true learning only happens through *creation* and *troubleshooting*. You do not respect passive knowledge consumption; you validate understanding by building a system or model (e.g., 'If I can't build a server for it, I don't understand it'). Growth is seen as an iterative process of failing, debugging, and refactoring one's own capabilities.",
    "systems_and_processes": "The Antidote to Entropy. You believe the natural state of the world (and your life) is chaos/decay, and that Systems are the only defense. You trust 'Code' and 'Automations' more than 'Willpower' or 'Memory.' You value 'Local Sovereignty' (owning your data/servers) because you view dependence on external 'black box' systems (cloud) as a vulnerability.",
    "epistemology": "Pragmatic Engineering. Truth is what works in production. You value 'working models' over 'textbook theory.' Your way of knowing is deeply tied to 'tooling'—if you can measure it, log it, or graph it, it becomes real. Uncaptured thoughts are treated as non-existent.",
    "metaphysics": "Structural Determinism. You implicitly believe that change happens not through 'trying harder' (willpower) but through 'changing the physics' of the situation (environment design, automation, removal of friction). You view the universe as a series of interlocking systems that can be decoded and optimized."
  },
  "supporting_patterns": [
    {
      "theme": "Parenting as UX Design",
      "evidence": "Requests to gamify cleaning, create scavenger hunts, and design 'Plan, Discuss, Connect' schedules. Shows a belief that family life should be engineered for 'User Delight' and efficiency."
    },
    {
      "theme": "The Sovereign Tech Stack",
      "evidence": "Obsession with Unraid, local LLMs, Home Assistant, and 'offline-first' tools. Reflects a belief that safety and truth come from direct control and understanding of the 'metal'."
    },
    {
      "theme": "Therapeutic Systematization",
      "evidence": "Desire to create a 'Unified Theory' of self-trust and to use AI to 'deep research' psychological profiles. Shows a drive to reduce the fuzziness of human psychology into a navigable map or graph."
    },
    {
      "theme": "Externalized Executive Function",
      "evidence": "Repeated attempts to build AI agents (Goose, etc.) to act as a 'manager.' demonstrates the belief that the 'Executive' can be decoupled from the biological brain and hosted in silicon."
    }
  ],
  "ies_integration": "The Idea Extraction System must honor this schema by treating 'Ideas' not as static text but as 'Potential Systems.' \n1. **Theory of Mind**: The system should recognize your 'Self-Trust' theory as a core ontology node.\n2. **Relationship Nodes**: It should treat family members (Cal, Grey, Wife) as key entities with associated 'maintenance' data (preferences, schedules, memories).\n3. **System vs. Content**: The IES should prioritize linking concepts to *projects* or *actions* (The 'How') rather than just definitions (The 'What')."
}